# Задания 1
# Напишите функции в файле-модуле my_file_functions, которые принимают два
# аргумента: первый file - имя файла, второй аргумент:
#  слово, результат: сколько раз встречается это слово;
#  символ, результат: сколько раз встречается этот символ;
#  буква, результат: сколько раз встречаются слова, начинающиеся на этот символ;
#  буква, результат: в скольких словах встречается эта буква.
# Проверьте правильность работы этих функций в другом файле.


import my_file_functions
print(my_file_functions.fs('test.txt','.'))
